{
  "//Header": "Раздел Header",
  "home": "Главная",
  "skills": "Навыки",
  "tests": "Тестовые",
  "projects": "Проекты",
  "cv": "Резюме",
  "contacts": "Контакты",
  "portfolioCode": "Код портфолио",

  "//MainPage": "Главная страница",

  "greeting": "Приветствую!",
  "name": "Меня зовут Дмитрий",
  "role": "Я фронтенд React разработчик",
  "typingText": "<p>Мне нравится то, что я делаю</p>",


  "//AboutMePage": "Обо мне",
  "aboutMe": "Обо Мне",
  "InfoAboutMe": "Добрый день. Меня зовут Дмитрий. Я долгое время работал техническим переводчиком в компании Exxon в Хьюстоне на Сахалинских проектах. Занимался устными переводами совещаний и письменными переводами технической и юридической литературы.\nВ свободное время увлёкся программированием и созданием сайтов, самостоятельно ознакомился с HTML, CSS, JavaScript. Прошёл обучение в IT INCUBATOR-е, где в течение года изучал React/Redux/TypeScript. Также прошл интенсивный курс по JAVA и SQL в Revature. Выполнял индивидуальные и командные проекты, а также участвовал в стартапе. В настоящее время принимаю участие в разработке проекта на Next.js/React Tool Kit/RTK Query.\nУмею хорошо разбираться в технической документации и находить решения на основании аналогий с имеющимися вариантами. На данном этапе все своё время посвящаю улучшению своих навыков в кодировании и ознакомлении с новыми технологиями.\n",


  "//SkillsPage": "Страница Навыки",

  "skills": "Навыки",

  "//MyProjectsPage": "Страница Мои проекты",

  "myProjects": "Мои проекты",

  "UnderDevelopment": "В разработке",

  "//MyProjectsPageButtons": "This is MyProjectsPageButtons",

  "inProgress": "В разработке",
  "viewProject": "Проект",
  "viewCode": "Код",
  "more": "Подробнее",
  "less": "Свернуть",
  "viewVideo": "Видео",

  "//list of Projects": "Перечень проектов",


  "//Тудулист": "Тудулист",

  "todolistTitle": "Список дел",
  "tdlDate": "Декабрь 2021 г.",
  "tdlStack": "СТЭК: ReactJS, TypeScript, Redux Toolkit, RestAPI, Axios, Redux-Thunk, Material UI, Yup, Unit testing, Storybook",
  "todolistDescription": "Функционал: валидация формы входа в систему и создания задач, создание/удаление туду листов, добавление/удаление задач, отображение статуса задач /фильтрация по статусу: «все», «в работе», «завершенные», обработка ошибок.\n\nПожалуйста, обратите внимание, что при открытии приложения и проверке его функционала, вы можете увидеть неорганизованные списки дел, так как к серверу есть свободный доступ и другие пользователи могут добавлять и удалять туду листы.\n",

  "//Социальная сеть": "Социальная сеть",

  "socialNetworkStack": "СТЭК: React, Redux, React Redux, React Router, Material-UI, Ant Design (Antd), Axios, Formik, Final Form, Yup, UUID, React YouTube, Reselect",
  "socialNetworkDate": "Апрель 2022 г.",
  "socialNetworkTitle": "Социальная сеть",
  "socialNetworkDescription": "Это проект социальной сети, реализованный с использованием классовых компонентов. Приложение позволяет пользователям выполнять различные действия, такие как просмотр зарегистрированных участников, добавление или удаление друзей, обновление своего статуса и добавление/удаление постов.",

  "//СтартАп": "СтартАп",

  "startUpDate": "Сентябрь, 2022 г.",
  "startUpStack": "СТЭК: Next.js, React, TypeScript, Axios, Formik, Yup, Sass, Swiper",
  "startUpTitle": "Стартап",
  "startUpDescription": "Стартап веб-студии SILEVANS. Веб сайт, с информацией о компании, с функционалом: заказа звонка, заполнения анкеты, портфолио.",

  "//Карточки": "Это карточки",

  "flashCardsDate": "Июнь 2022 г.",
  "flashCardsStack": "СТЭК: TypeScript, React, Redux, React-Redux, Redux-Thunk, React-Router-dom, Axios, Material UI, React-Hook-Form, HTML, CSS, ESLint, Prettier",
  "flashCardsTitle": "Карточки",
  "flashCardsDescription": "Функционал: регистрация, логинизация, восстановление пароля, запоминание пользователя “remember me”, поиск колод с карточками, сортировка колод по параметрам: мои / чужие,  количеству карточек, сортировка таблицы по разным параметрам, создание / удаление колод / карточек, использованием модалок, переход в режим обучения. Проект в публичном доступе поэтому отсутствует контроль содержания карточек. Более подробная информация по приложению представлена в Read me при переходе к коду.",

  "//Инсктогарм": "Инктограм",

  "inctagramDate": "В разработке",
  "inctagramStack": "СТЭК: Next.js, React, Redux, RTK Query, Next Redux Wrapper, TypeScript, Sass, Yup,\n•\tnext-i18next, React-i18next, React-Hook-Form, React-Easy-Crop, React-Paginate, React-Select, Notistack, Storybook\n",
  "inctagramTitle": "В разработке",
  "inctagramDescription": "Это командный проект иммитирующий Instagram с участием 5 фронтэнд разработчиков и 1 бэкэнд разработчика.",

  "//Angular": "Angular",

  "angularHomesDate": "Начальная стадия изучения (в разработке)",
  "angularHomesStack": "СТЭК: Angular",
  "angularHomesTitle": "В процессе изучения",
  "angularHomesDescription": "Только приступил к изучению фреймворка Angular",

  "MoreProjects": "Больше проектов",
  "LessProjects": "Свернуть",

  "//MyTestsPage": "MyTestsPage",

  "myTests": "Тестовые задания",

  "StartedToStudy": "Только приступил к изучению",

  "//MyTestsPageButtons": "MyTestsPageButtons",

  "inProgress": "В разработке",
  "viewProject": "Проект",
  "viewCode": "Код",
  "more": "Подробнее",
  "less": "Свернуть",
  "viewVideo": "Видео",

  "//Тестовое на сагах": "Тестовое на сагах",

  "sagaAssignmentDate": "Май 2023 г.",
  "sagaAssignmentStack": "СТЭК: React, Redux, React Router, Bootstrap, Axios, Redux Saga ",
  "sagaAssignmentTitle": "Тестовое задание",
  "sagaAssignmentDescription": "Подробное описание тестового задания представлено в коде в разделе Read me.",

  "//Вотсап": "Это вотсАп",

  "whatsUpDate": "Май 2023 г.",
  "whatsUpStack": "СТЭК: React, React Router DOM, React Redux, React Hook Form, React Toastify, RTK Query",
  "whatsUpTitle": "Тестовое приложение WhatsUp",
  "whatsUpDescription": "26 мая 2023 года. Это тестовая версия приложения WhatsUp. Следующий шаг - обеспечить связь с сервером.",



  "//contactsPage": "Контакты",

  "contactsOpenTag": "<div>",
  "contactsCloseTag": "<div />",
  "letsGetInTouch": "Отправьте мне сообщение",
  "formName": "Меня зовут Дмитрий",
  "yourName": "Ваше имя",
  "email": "Адрес электронной почты*",
  "yourEmail": "Ваша электронная почта",
  "message": "Сообщение*",
  "yourMessage": "Ваше сообщение",
  "send": "Отправить",
  "formNote": "Я рабочая форма, настроенная с emailjs, пожалуйста, отправляйте ваши сообщения Дмитрию!",

  "//footerPage": "Футер",

  "adoptedForSmartphones": "Адаптировано для смартфонов",
  "copyRight": "© ДвадцатьДвадцатьТри",
  "downloadMyCv": "Скачать резюме",
  "portfolioStack": "СТЭК портфолио: React, TypeScript, Material-UI, MUI Icons, EmailJS, Formik, i18next, React Awesome Reveal, React Flag Kit, React Icons, React Tilt, React Toastify, React Typing Effect "
}
